In [5]:
import pandas as pd 
list = [['Nitesh',21],['Khemu',23],['Achint',21],['Ayush',22]]
print(list)

[['Nitesh', 21], ['Khemu', 23], ['Achint', 21], ['Ayush', 22]]

In [7]:
pd.DataFrame(list,index=['Student:1','Student:2','Student:3','Student:4'],columns=['Name','Age'])

             Name  Age
Student:1  Nitesh   21
Student:2   Khemu   23
Student:3  Achint   21
Student:4   Ayush   22

In [9]:
import numpy as np

In [11]:
arr = np.array(([2,3],[5,6]))

In [13]:
pd.DataFrame(arr)

   0  1
0  2  3
1  5  6

In [35]:
pd.read_excel("Data.xlsx")

      Name School  Marks
0  Shubham    SPS     34
1   Joshua    UPS     45
2     jack    UIS     45
3     Alex    RTS     67
4  Jasmine    WPS     45
5   Rohan     RRY     88
6    Rishi    NRI     77
7   Aakash    DPS     90

In [37]:
df=pd.read_csv("Data.csv")

In [39]:
df

      Name School  Marks
0  Shubham    SPS     34
1   Joshua    UPS     45
2     jack    UIS     45
3     Alex    RTS     67
4  Jasmine    WPS     45
5   Rohan     RRY     88
6    Rishi    NRI     77
7   Aakash    DPS     90

In [59]:
df=pd.read_json("Hey.json")

In [61]:
df

     name  age
0  Nitesh   30
1  Niyati   32

In [77]:
df=pd.read_csv("https://gist.githubusercontent.com/netj/8836201/raw/6f9306ad21398ea43cba4f7d537619d0e07d5ae3/iris.csv")

In [79]:
df

     sepal.length  sepal.width  petal.length  petal.width    variety
0             5.1          3.5           1.4          0.2     Setosa
1             4.9          3.0           1.4          0.2     Setosa
2             4.7          3.2           1.3          0.2     Setosa
3             4.6          3.1           1.5          0.2     Setosa
4             5.0          3.6           1.4          0.2     Setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  Virginica
146           6.3          2.5           5.0          1.9  Virginica
147           6.5          3.0           5.2          2.0  Virginica
148           6.2          3.4           5.4          2.3  Virginica
149           5.9          3.0           5.1          1.8  Virginica

[150 rows x 5 columns]

In [81]:
df.head()

   sepal.length  sepal.width  petal.length  petal.width variety
0           5.1          3.5           1.4          0.2  Setosa
1           4.9          3.0           1.4          0.2  Setosa
2           4.7          3.2           1.3          0.2  Setosa
3           4.6          3.1           1.5          0.2  Setosa
4           5.0          3.6           1.4          0.2  Setosa

In [83]:
df.tail()

     sepal.length  sepal.width  petal.length  petal.width    variety
145           6.7          3.0           5.2          2.3  Virginica
146           6.3          2.5           5.0          1.9  Virginica
147           6.5          3.0           5.2          2.0  Virginica
148           6.2          3.4           5.4          2.3  Virginica
149           5.9          3.0           5.1          1.8  Virginica

In [86]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   sepal.length  150 non-null    float64
 1   sepal.width   150 non-null    float64
 2   petal.length  150 non-null    float64
 3   petal.width   150 non-null    float64
 4   variety       150 non-null    object
dtypes: float64(4), object(1)
memory usage: 6.0+ KB

In [88]:
df.describe()

       sepal.length  sepal.width  petal.length  petal.width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.057333      3.758000     1.199333
std        0.828066     0.435866      1.765298     0.762238
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

In [100]:
df.columns

Index(['sepal.length', 'sepal.width', 'petal.length', 'petal.width',
       'variety'],
      dtype='object')

In [102]:
df.index

RangeIndex(start=0, stop=150, step=1)

In [104]:
df.shape

(150, 5)